# FindByName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExportDWGSettings..::..FindByName Method
ExportDWGSettings Class See Also
---
Returns the pre-defined non-in-session exporting settings for DWG in the given document with the specified name.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static ExportDWGSettings FindByName(
	Document aDoc,
	string name
)
```

Visual Basic
---
```text
Public Shared Function FindByName ( _
	aDoc As Document, _
	name As String _
) As ExportDWGSettings
```

Visual C++
---
```text
public:
static ExportDWGSettings^ FindByName(
	Document^ aDoc,
	String^ name
)
```

# ### Parameters
aDoc
    Type: Autodesk.Revit.DB..::..Document A Revit document to retrieve the specified pre-defined exporting settings for DWG.
name
    Type: System..::..String The name of the settings to retrieve.
# ### Return Value
The pre-defined DWG exporting settings, or null if nothing found that has the corresponding name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExportDWGSettings Class
Autodesk.Revit.DB Namespace